Tekla Open API Reference for Tekla Structures 2025
ModelHistory.GetNotSharedObjects Method
Get object which are was created or modified since last ModelSharing WriteOut.
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static ModelObjectEnumerator GetNotSharedObjects()
Public Shared Function GetNotSharedObjects As ModelObjectEnumerator
Return Value
Type: ModelObjectEnumerator
A list of objects
Remarks
If the model is not shared, returns all objects.
See Also
Reference
ModelHistory Class
Tekla.Structures.Model.History Namespace